#### Terraform Plan 📋 `stage/network`

**Summary:** 11:39:25.676 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
11:39:05.441 STDOUT terraform: Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
11:39:05.441 STDOUT terraform: will stop streaming the logs, but will not stop the plan running remotely.
11:39:05.441 STDOUT terraform: Preparing the remote plan...
11:39:07.073 STDOUT terraform: To view this run in a browser, visit:
11:39:07.073 STDOUT terraform: https://app.terraform.io/app/my-devops-project/my-devops-project-stage-network/runs/run-zNVxta2pyVvy2mTx
11:39:08.538 STDOUT terraform: Waiting for the plan to start...
11:39:22.363 STDOUT terraform: Terraform v1.14.0
11:39:22.363 STDOUT terraform: on linux_amd64
11:39:22.363 STDOUT terraform: Initializing plugins and modules...
11:39:25.675 STDOUT terraform: Terraform used the selected providers to generate the following execution
11:39:25.675 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
11:39:25.675 STDOUT terraform:   + create
11:39:25.675 STDOUT terraform: Terraform will perform the following actions:
11:39:25.675 STDOUT terraform:   # digitalocean_vpc.vpc will be created
11:39:25.675 STDOUT terraform:   + resource "digitalocean_vpc" "vpc" {
11:39:25.675 STDOUT terraform:       + created_at = (known after apply)
11:39:25.675 STDOUT terraform:       + default    = (known after apply)
11:39:25.675 STDOUT terraform:       + id         = (known after apply)
11:39:25.675 STDOUT terraform:       + ip_range   = "10.20.0.0/24"
11:39:25.676 STDOUT terraform:       + name       = "stage-vpc"
11:39:25.676 STDOUT terraform:       + region     = "fra1"
11:39:25.676 STDOUT terraform:       + urn        = (known after apply)
11:39:25.676 STDOUT terraform:     }
11:39:25.676 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
11:39:25.676 STDOUT terraform: Changes to Outputs:
11:39:25.676 STDOUT terraform:   + vpc_id     = (known after apply)
11:39:25.676 STDOUT terraform:   + vpc_name   = "stage-vpc"
11:39:25.676 STDOUT terraform:   + vpc_region = "fra1"
11:39:25.849 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
11:39:25.850 STDOUT terraform: Saved the plan to: tfplan
11:39:25.850 STDOUT terraform: To perform exactly these actions, run the following command to apply:
11:39:25.850 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*